<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"ef82f036163b87f42ee577a2c81d3cf21796a96fa81b1fcbed2a36d0c86e8d6f","plan_job_ref":"Job Pull Request Checks #4484 at https://github.com/GSA-TTS/FAC/actions/runs/13920928246","plan_out_hash":"ce5c23a0278abd9af5b4e3be2592b720df39683be124492cc9e87b17eb63e2c7","plan_hash":"0102510fed99750ca40825365af0eb1351e119ac1c6e4c23ea9bb47c7d8e2a75","plan_text_format":"diff","version":"1.47.0"} -->
Terraform plan for __production__
<details>
<summary>Plan: 1 to add, 5 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.domain.cloudfoundry_route.origin_route_connected[0] will be updated in-place
!~  resource "cloudfoundry_route" "origin_route_connected" {
!~      destinations = [
-           {
-               app_id           = "5dac166f-2fb0-4e72-8d4d-4359191bf284" -> null
-               app_process_type = "web" -> null
-               id               = "630362da-7f8f-47d2-8666-c75ad2b045fd" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = "************************************"
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "8002e69b-ba74-41a8-b5f3-e689ed3d4023"
#        (7 unchanged attributes hidden)
    }

  # module.production.cloudfoundry_network_policy.app-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "app-network-policy" {
        id = "41e96938-1383-c2ce-3157-af85063feaa3"

-       policy {
-           destination_app = "ae5cd101-195d-4ca1-8a26-58b6a08a1fdb" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "15290fef-8636-4e27-9b57-c86318f85cc8" -> null
        }
-       policy {
-           destination_app = "ae5cd101-195d-4ca1-8a26-58b6a08a1fdb" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "5dac166f-2fb0-4e72-8d4d-4359191bf284" -> null
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "15290fef-8636-4e27-9b57-c86318f85cc8"
        }
+       policy {
+           destination_app = (known after apply)
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = "5dac166f-2fb0-4e72-8d4d-4359191bf284"
        }
    }

  # module.production.cloudfoundry_network_policy.clamav-network-policy will be updated in-place
!~  resource "cloudfoundry_network_policy" "clamav-network-policy" {
        id = "bffa4f44-73e2-295d-6c7e-2809a21406d6"

-       policy {
-           destination_app = "5e81ca8b-99cf-41f8-ae42-76652d51a44c" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "99ba1218-5b6e-42fc-9484-00eebde48eda" -> null
        }
-       policy {
-           destination_app = "5e81ca8b-99cf-41f8-ae42-76652d51a44c" -> null
-           port            = "61443" -> null
-           protocol        = "tcp" -> null
-           source_app      = "ae5cd101-195d-4ca1-8a26-58b6a08a1fdb" -> null
        }
+       policy {
+           destination_app = "5e81ca8b-99cf-41f8-ae42-76652d51a44c"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
+       policy {
+           destination_app = "5e81ca8b-99cf-41f8-ae42-76652d51a44c"
+           port            = "61443"
+           protocol        = "tcp"
+           source_app      = (known after apply)
        }
    }

  # module.production.module.clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T15:36:41Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:b74a991de6029f90524ce976f90286263f4e5709fd4fb40f8c1f7055c2478ba4" -> "ghcr.io/gsa-tts/fac/clamav@sha256:62bc1afee9a5c8f9f4cfcb475b117306cefb63053666080949f9c7d955345116"
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-production"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-03-14T15:36:44Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # module.production.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2025-03-14T18:11:27Z" -> (known after apply)
        }
    }

  # module.production.module.file_scanner_clamav.cloudfoundry_app.clamav_api will be updated in-place
!~  resource "cloudfoundry_app" "clamav_api" {
+       buildpacks                      = (known after apply)
!~      created_at                      = "2025-03-14T15:36:41Z" -> (known after apply)
!~      docker_image                    = "ghcr.io/gsa-tts/fac/clamav@sha256:b74a991de6029f90524ce976f90286263f4e5709fd4fb40f8c1f7055c2478ba4" -> "ghcr.io/gsa-tts/fac/clamav@sha256:62bc1afee9a5c8f9f4cfcb475b117306cefb63053666080949f9c7d955345116"
!~      health_check_type               = "port" -> (known after apply)
!~      id                              = "************************************" -> (known after apply)
!~      log_rate_limit_per_second       = "-1" -> (known after apply)
        name                            = "fac-av-production-fs"
!~      readiness_health_check_type     = "process" -> (known after apply)
!~      stack                           = null -> (known after apply)
!~      updated_at                      = "2025-03-14T15:36:45Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

Plan: 1 to add, 5 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #4484](https://github.com/GSA-TTS/FAC/actions/runs/13920928246)